{
  "_name_or_path": "distilbert-base-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "NUMERIC",
    "1": "DATE",
    "2": "LOCATION",
    "3": "HUMAN_GROUP",
    "4": "HUMAN_INDIVIDUAL",
    "5": "ENTITY",
    "6": "ABBREVIATION",
    "7": "DESCRIPTION",
    "8": "BOOLEAN",
    "9": "EXPLANATION"
  },
  "initializer_range": 0.02,
  "label2id": {
    "NUMERIC": 0,
    "DATE": 1,
    "LOCATION": 2,
    "HUMAN_GROUP": 3,
    "HUMAN_INDIVIDUAL": 4,
    "ENTITY": 5,
    "ABBREVIATION": 6,
    "DESCRIPTION": 7,
    "BOOLEAN": 8,
    "EXPLANATION": 9
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.16.2",
  "vocab_size": 30522
}
